# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. **We can think of a DataFrame as a bunch of Series objects put together to share the same index.** Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [4]:
from numpy.random import randn
np.random.seed(101)
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [12]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split()) # index and columns are optional

In [13]:
df # combination of bunch of panda series

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [14]:
df['W'] # return series  df.W is possible, but not recommended

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [16]:
# Pass a list of column names: it is returned in the form of 2D array
df[['W','Z']] # it is like getting data using SQL statement (select statement)

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [17]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

DataFrame Columns are just Series

In [18]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [19]:
df['new'] = df['W'] + df['Y'] # adding new column

In [29]:
df

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

**Removing Columns**

In [30]:
df.drop('new',axis=1) # NOTE: note: axis : {0 or 'index', 1 or 'columns'}, default 0
    # Whether to drop labels from the index (0 or 'index') or
    # columns (1 or 'columns').'''

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [31]:
# NOTE: Not inplace unless specified!
df

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [32]:
df.drop('new',axis=1,inplace=True) # inplace=True means actuall "commit" (permanent move)

In [34]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

Can also drop rows this way:

In [35]:
df.drop('E',axis=0) # deleting record. NOTE: axis = 0

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [43]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [39]:
df.shape

(5, 4)

**Selecting Rows**

In [40]:
# 1. first way

In [45]:
df.loc['A'] # c.f df[['A','B']] returns columns.

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [47]:
df.loc[['A','B']]

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990

Or select based off of position instead of label

In [42]:
# 2. secibd way

In [48]:
df.iloc[2] # integer based

W    0.666319
X   -0.538235
Y   -0.568581
Z    1.407338
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [49]:
df.loc['B','Y'] # row first, column later

-0.8551960407780934

In [50]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.467514 -0.162535
B  0.392489 -0.855196

### Conditional Selection

An important feature of pandas is **conditional selection** using bracket notation, very similar to numpy:

In [51]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [52]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True   True  False   True
C   True  False  False   True
D   True  False  False   True
E  False  False   True  False

In [53]:
df[df>0] # get all column value

          W         X         Y         Z
A       NaN       NaN       NaN  0.485809
B  0.392489  0.221491       NaN  1.541990
C  0.666319       NaN       NaN  1.407338
D  0.641806       NaN       NaN  1.028293
E       NaN       NaN  0.720788       NaN

In [58]:
df['W'] > 0 # get series value

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [57]:
df[df['W']>0] # get all columns. NOTE : It is different from df[df>0].

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [59]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [60]:
df[df['W']>0]

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [61]:
df[df['W']>0]['Y']

B   -0.855196
C   -0.568581
D   -0.391157
Name: Y, dtype: float64

In [62]:
df[df['W']>0][['Y','X']] # multiple column

          Y         X
B -0.855196  0.221491
C -0.568581 -0.538235
D -0.391157 -0.905100

For two conditions you can use | and & with parenthesis:

In [65]:
df[(df['W']>0) & (df['Y'] > 1)] #NOTE: no 'and', 'or'. Insteand & or |

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [68]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [69]:
# Reset to default 0,1...n index
df.reset_index() #unless specified, inplace=true, it won't commit

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [70]:
newind = 'CA NY WY OR CO'.split()

In [71]:
df['States'] = newind

In [72]:
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [73]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

In [74]:
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [75]:
df.set_index('States',inplace=True)

In [76]:
df

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a **Multi-Indexed DataFrame** would look like:

In [89]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # return tuple list
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [90]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [91]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.606780 -1.115710
   2 -1.385379 -1.329660
   3  0.041460 -0.411055
G2 1 -0.771329  0.110477
   2 -0.804652  0.253548
   3  0.649148  0.358941

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [92]:
df.loc['G1']

          A         B
1  1.606780 -1.115710
2 -1.385379 -1.329660
3  0.041460 -0.411055

In [93]:
df.loc['G1'].loc[1]

A    1.60678
B   -1.11571
Name: 1, dtype: float64

In [94]:
df.index.names

FrozenList([None, None])

In [95]:
df.index.names = ['Group','Num']

In [96]:
df

                  A         B
Group Num
G1    1    1.606780 -1.115710
      2   -1.385379 -1.329660
      3    0.041460 -0.411055
G2    1   -0.771329  0.110477
      2   -0.804652  0.253548
      3    0.649148  0.358941

In [97]:
df.xs('G1')

            A         B
Num
1    1.606780 -1.115710
2   -1.385379 -1.329660
3    0.041460 -0.411055

In [98]:
df.xs(['G1',1])

A    1.60678
B   -1.11571
Name: (G1, 1), dtype: float64

In [99]:
df.xs(1,level='Num')

              A         B
Group
G1     1.606780 -1.115710
G2    -0.771329  0.110477